clear;
%вспомогательные переменные для построения графика
n = 200;
x1 = zeros(1, n);
x2 = zeros(1, n);
t = zeros(1, n);
x1(1) = 12;x2(1) = 12;t(1) = 1;
h = 0.05;
%коэффициенты
a1 = 0.700000; a2 = 0.500000;
b1 = 0.200000; b2 = 0.100000;
T1 = 0.02000; T2 = 0.710000;
ro = 1.000000; d =0;
%система
psi1 = @(x1,x2)(x1 - ro*x2 + d);
psi2 = @(x1,x2)(x1 - ro*x2 + d);
u1 = @(x1,x2)((-psi1(x1,x2)/T1) - a1*x1 + b1*x1*x2 - ro*a2*x2 + ro*b2*x1*x2);
u2 = @(x1,x2)((psi2(x1,x2)/(T2*ro))+((a1*x1-b1*x1*x2)/ro)+a2*x2-b2*x1*x2);
dx1 = @(x1,x2)(a1*x1-b1*x1*x2 + u1(x1,x2)); 
dx2 = @(x1,x2)(-a2*x2 + b2*x1*x2 + u2(x1,x2));


%метод Эйлера
for i = 2:n
 x1(i) = x1(i-1) + h*(dx1(x1(i-1),x2(i-1)));
 x2(i) = x2(i-1) + h*(dx2(x1(i-1),x2(i-1)));
 t(i) = i;
end
%построение графика
plot(t,x1)
xlabel("Время")
ylabel("Численность видов")
hold on
plot(t, x2)
legend('Жертвы','Хищники')
hold off

fprintf('Пропорция:\n%f\n',x1(n)/x2(n));
fprintf('Psi стремится к:\n%f\n',psi2(x1(n),x2(n)));